# BtuPerHFtSup2 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..BtuPerHFtSup2 Property
SymbolTypeId Class See Also
---
Symbol Btu/(h·ft²), indicating unit British thermal units per hour square foot.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId BtuPerHFtSup2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BtuPerHFtSup2 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BtuPerHFtSup2 {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace